1. Create a table called employees with the following structure
 emp_id (integer, should not be NULL and should be a primary key)
 emp_name (text, should not be NULL)
 age (integer, should have a check constraint to ensure the age is at least 18)
 email (text, should be unique for each employee)
 salary (decimal, with a default value of 30,000).
 Write the SQL query to create the above table with all constraints.

```sql
create database employee;
use employee;
create table employees(
	emp_id int primary key not null,
    emp_name text not null,
    age int check(age >= 18),
    email varchar(100) unique,
    salary decimal(10,2) default 30000
)

select * from employee;

2. Explain the purpose of constraints and how they help maintain data integrity in a database. Provide
examples of common types of constraints
- Constraints are rules applied to table columns in a database to ensure the accuracy, validity, and reliability of the data.
They help maintain data integrity by restricting the type of data that can be stored in a table.
```sql
create table employees(
    emp_id int primary key not null,
    emp_name text not null,
    age int check(age >= 18),
    email varchar(100) unique,
    salary decimal(10,2) default 30000
)

  3.Why would you apply the NOT NULL constraint to a column? Can a primary key contain NULL values? Justify
  your answer
  - to ensure the field is not left empty or you can say it is a compulsury field to fill up.
  - no primary key can't store null values because it uniquely identifies the records and it helps to identify unique rows and create foriegn key thats why it can contain null values.

 4. Explain the steps and SQL commands used to add or remove constraints on an existing table. Provide an
example for both adding and removing a constraint
- adding :
```sql
ALTER TABLE employees
ADD CONSTRAINT unique_email UNIQUE (email);
```
- remove :
```sql
ALTER TABLE employees
DROP INDEX unique_email;
```

5. Explain the consequences of attempting to insert, update, or delete data in a way that violates constraints.
Provide an example of an error message that might occur when violating a constraint
- it will throw errors  
```sql
INSERT INTO employees (emp_id, emp_name, age, email)
VALUES (2, 'Alice', 16, 'alice@example.com');
```
- Error Code: 3819. Check constraint 'employee_chk_1' is violated.	0.015 sec

 6. You created a products table without constraints as follows:
 CREATE TABLE products (
 product_id INT,
 product_name VARCHAR(50),
 price DECIMAL(10, 2));
 Now, you realise that
 The product_id should be a primary key
 The price should have a default value of 50.00
 - changing the product_id = ALTER TABLE employees ADD CONSTRAINT pk_product PRIMARY KEY (product_id);
 - setting default values = ALTER TABLE employees MODIFY price DECIMAL(10,2) DEFAULT 50.00;

  7.Write a query to fetch the student_name and class_name for each student using an INNER JOIN
```sql
select student_name , class_name from Students s inner join Classes c on s.class_id = c.class_id;

8. Write a query that shows all order_id, customer_name, and product_name, ensuring that all products are
listed even if they are not associated with an order
Hint: (use INNER JOIN and LEFT JOIN
``` sql
SELECT
    o.order_id,
    c.customer_name,
    p.product_name
FROM Products p
LEFT JOIN Orders o ON p.order_id = o.order_id
LEFT JOIN Customers c ON o.customer_id = c.customer_id;

9.Write a query to find the total sales amount for each product using an INNER JOIN and the SUM() function.
```sql
select p.product_id,p.product,sum(amount) as total from employee.products p inner join employee.sales s on p.product_id = s.product_id group by p.product_id;

10. Write a query to display the order_id, customer_name, and the quantity of products ordered by each
customer using an INNER JOIN between all three tables.
```sql
SELECT
    o.order_id,
    c.customer_name,
    od.quantity
FROM Orders o
INNER JOIN Customers c ON o.customer_id = c.customer_id
INNER JOIN Order_Details od ON o.order_id = od.order_id;

11) 1-Identify the primary keys and foreign keys in maven movies db. Discuss the differences
```sql
 Primary Keys:
actor(actor_id), address(address_id), category(category_id), city(city_id),
country(country_id), customer(customer_id), film(film_id), inventory(inventory_id),
language(language_id), payment(payment_id), rental(rental_id), staff(staff_id), store(store_id)

Foreign Keys:
city(country_id), address(city_id), customer(address_id, store_id), staff(address_id, store_id),
store(address_id), film(language_id), film_actor(film_id, actor_id), film_category(film_id, category_id),
inventory(film_id, store_id), rental(inventory_id, customer_id, staff_id), payment(customer_id, staff_id, rental_id)

Difference:
PRIMARY KEY uniquely identifies each record (unique, not null)
FOREIGN KEY references a primary key in another table (can be duplicated, can be null)

12)List all details of actors
```sql
select * from actor;

13) List all customer information from DB
- SELECT * FROM customer;

14)List different countries.
- SELECT DISTINCT country FROM country;

15)Display all active customers
- SELECT * FROM customer WHERE active = 1;

16)List all rental IDs for customer with ID 1
- SELECT rental_id FROM rental WHERE customer_id = 1;

17)Display all films whose rental duration is greater than 5
- SELECT * FROM film WHERE rental_duration > 5;

18) Count films with replacement cost > 15 and < 20
```sql
SELECT COUNT(*) AS total_films
FROM film
WHERE replacement_cost > 15 AND replacement_cost < 20;
```
19)Count of unique actor first names
- SELECT COUNT(DISTINCT first_name) AS unique_first_names
FROM actor;

20)Display first 10 customers
- SELECT * FROM customer LIMIT 10 offset 0;

21)First 3 customers whose first name starts with 'B'
```sql
SELECT * FROM customer
WHERE first_name LIKE 'B%'
LIMIT 3;
```

22)First 5 movies rated â€˜Gâ€™
```sql
SELECT title
FROM film
WHERE rating = 'G'
LIMIT 5;
```
23)Customers whose first name starts with 'A'
- SELECT * FROM customer WHERE first_name LIKE 'A%';

24)Customers whose first name ends with 'A'
- SELECT * FROM customer
WHERE first_name LIKE '%A';

25) First 4 cities which start and end with â€˜Aâ€™
```sql
SELECT city
FROM city
WHERE city LIKE 'A%A'
LIMIT 4;
```

26)Customers whose first name contains 'NI'
- SELECT * FROM customer
WHERE first_name LIKE '%NI%';
27)Customers whose first name has 'R' in second position
- SELECT * FROM customer
WHERE first_name LIKE '_R%';

28)Customers whose first name starts with 'A' and has â‰¥ 5 characters
```sql
SELECT * FROM customer
WHERE first_name LIKE 'A%'
AND LENGTH(first_name) >= 5;
```

29)Customers whose first name starts with 'A' and ends with 'O'
```sql
SELECT * FROM customer
WHERE first_name LIKE 'A%O';
```

30)Films rated â€˜PGâ€™ or â€˜PG-13â€™
```sql
SELECT * FROM film
WHERE rating IN ('PG', 'PG-13');
```

31)Films with length between 50 and 100
```sql
SELECT * FROM film
WHERE length BETWEEN 50 AND 100;
```

32)Top 50 actors
- SELECT * FROM actor LIMIT 50;

33)Distinct film IDs from inventory
- SELECT DISTINCT film_id FROM inventory;

**Functions**

1)Retrieve the total number of rentals made in the Sakila database.
Hint: Use the COUNT() function.

- SELECT COUNT(*) AS total_rentals
FROM rental;

2)Question 2:

Find the average rental duration (in days) of movies rented.
Hint: Use the AVG() function.

- SELECT AVG(rental_duration) AS avg_rental_duration
FROM film;

3)Question 3:

Display the first name and last name of customers in uppercase.
Hint: Use the UPPER() function.
```sql
SELECT
    UPPER(first_name) AS first_name_upper,
    UPPER(last_name) AS last_name_upper
FROM customer;
```

4)Question 4:

Extract the month from the rental date and display it with rental ID.
Hint: Use the MONTH() function.
```sql
SELECT
    rental_id,
    MONTH(rental_date) AS rental_month
FROM rental;
```

**Group** **By**

1)Question 6:

Find the total revenue generated by each store.
Hint: Combine SUM() and GROUP BY.
ðŸ’¡ payment table has amount and staff_id â†’ staff table has store_id.
```sql
SELECT
    s.store_id,
    SUM(p.amount) AS total_revenue
FROM payment p
JOIN staff s ON p.staff_id = s.staff_id
GROUP BY s.store_id;
```